app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings"
---
  def index
  	@sighting = Sighting.all

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
  	@sighting = Sighting.find(params[:id])